YFStore/app/Controllers/AdminController.php

    public function store()
    {
        $model = new ProdukModel();
        $data = [
            'nama' => $this->request->getPost('nama'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'harga' => $this->request->getPost('harga'),
            'gambar' => $this->uploadImage(),
            'kategori' => ucwords(strtolower($this->request->getPost('kategori'))), // Konsistensi kategori
            'stok' => $this->request->getPost('stok'),
            'ukuran' => $this->request->getPost('ukuran')
        ];
        $model->save($data);
---
INSERT INTO `produk` (`nama`, `deskripsi`, `harga`, `gambar`, `kategori`, `stok`, `ukuran`) VALUES ('Jersey Team Esperion', 'Jersey premium dan original bahan aman dan nyaman murah', '200000', 'bola3.png', 'Sepak Bola', '7', 'M')