YFStore/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'yonaldi@gmail.com'
 LIMIT 1
---
    public function signinStore()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();