YFStore/app/Controllers/KeranjangController.php

    public function index()
    {
        $keranjangModel = new KeranjangModel();
        $produkModel = new ProdukModel();
        $keranjang = $keranjangModel->where('user_id', session()->get('id'))->findAll();
---
SELECT *
FROM `keranjang`
WHERE `user_id` = '11'