YFStore/app/Controllers/ProdukController.php

SELECT *
FROM `produk`
WHERE `produk`.`id` = '36'
---
    public function addToCart($produk_id)
    {
        $keranjangModel = new KeranjangModel();
        $produkModel = new ProdukModel();
        $produk = $produkModel->find($produk_id);