YFStore/app/Models/ProdukModel.php

SELECT *
FROM `produk`
---
    public function getAllProduk()
    {
        return $this->findAll();